org/episodes.org
# -*- eval: (load-file "./ubuntu-security-podcast.el") -*-
#+HUGO_SECTION: episode
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
# ensure only a single author is listed, not an array otherwise breaks castinet theme?
# https://github.com/kaushalmodi/ox-hugo/issues/180
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "Alex Murray" :explicit no :episode_image img/episode/default.png

* Episode 20
:PROPERTIES:
:EXPORT_FILE_NAME: episode-20
:EXPORT_DATE: 2019-02-11
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :episode_image img/episode/default.png :explicit no :podcast_file USP_E020.mp3 :podcast_duration "16:55" :podcast_bytes "16242441" :permalink "https://ubuntusecuritypodcast.org/episode-20/"
:END:
#+begin_description
This week we look at Linux kernel updates for all releases, OpenSSH, dovecot, curl and more. Plus we answer some frequently asked questions for Ubuntu security, in particular the perennial favourite of why we choose to just backport security fixes instead of doing rolling package version updates to resolve outstanding CVEs.
#+end_description
** Overview
This week we look at Linux kernel updates for all releases, OpenSSH, dovecot, curl and more. Plus we answer some frequently asked questions for Ubuntu security, in particular the perennial favourite of why we choose to just backport security fixes instead of doing rolling package version updates to resolve outstanding CVEs.
** This week in Ubuntu Security Updates
33 unique CVEs addressed
*** [[[https://usn.ubuntu.com/3871-3/][USN-3871-3]], [[https://usn.ubuntu.com/3871-4/][USN-3871-4]], [[https://usn.ubuntu.com/3871-5/][USN-3871-5]]] Linux kernel vulnerabilities
- 13 CVEs addressed in Bionic and Xenial (HWE - backport of Bionic kernel to Xenial)
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-9516][CVE-2018-9516]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19407][CVE-2018-19407]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-18281][CVE-2018-18281]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-17972][CVE-2018-17972]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16882][CVE-2018-16882]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14625][CVE-2018-14625]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10883][CVE-2018-10883]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10880][CVE-2018-10880]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10882][CVE-2018-10882]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10878][CVE-2018-10878]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10877][CVE-2018-10877]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10879][CVE-2018-10879]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10876][CVE-2018-10876]]
- Last week ([[https://ubuntusecuritypodcast.org/episode-19/][Episode 19]]) covered kernel update for Bionic in preparation for 18.04.2
  - this is the corresponding update for various platforms using the Bionic kernel
  - (AWS, GCP, KVM, OEM, Raspberry Pi 2) (Azure)

*** [[[https://usn.ubuntu.com/3878-1/][USN-3878-1]], [[https://usn.ubuntu.com/3878-2/][USN-3878-2]]] Linux kernel vulnerabilities
- 4 CVEs addressed in Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19854][CVE-2018-19854]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19407][CVE-2018-19407]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16882][CVE-2018-16882]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14625][CVE-2018-14625]]
- Last week ([[https://ubuntusecuritypodcast.org/episode-19/][Episode 19]]) covered kernel update for Bionic in preparation for 18.04.2
  - Included the Cosmic HWE kernel for Bionic as well - this is the corresponding update for Cosmic itself on all supported platforms (physical and cloud etc)

*** [[[https://usn.ubuntu.com/3879-1/][USN-3879-1]], USN-3879-2] Linux kernel vulnerabilities
- 5 CVEs addressed in Xenial and Trusty (Xenial HWE)
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-20169][CVE-2018-20169]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19824][CVE-2018-19824]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19407][CVE-2018-19407]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16862][CVE-2018-16862]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10883][CVE-2018-10883]]
- OOB read on reading USB device descriptor  - need local physical access to connect a malicious device - crash -> DoS
- UAF in ALSA via a malicious USB sound device that expose zero interfaces - crash -> DoS, possible code execution
- Uninitialised ioapics ([[https://ubuntusecuritypodcast.org/episode-19/][Episode 19]])
- Cleancache subsystem - after file truncation (removal), wouldn't properly clear inode so if a new file was created with the same inode might contain leftover pages from cleancache and hence the data from the old file
  - Only affects Ubuntu kernels under Xen with tmem driver
- ext4 - OOB write via malicious crafted image

*** [[[https://usn.ubuntu.com/3880-1/][USN-3880-1]], USN-3880-2] Linux kernel vulnerabilities
- 4 CVEs addressed in Trusty and Precise ESM (Trusty HWE)
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-9568][CVE-2018-9568]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-18281][CVE-2018-18281]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-17972][CVE-2018-17972]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-1066][CVE-2018-1066]]
- Possible memory corruption via type confusion when cloning a socket - privilege escalation
- mremap() issue (covered in [[https://ubuntusecuritypodcast.org/episode-15/][Episode 15]])
- procfs stack unwinding to leak kernel stack from other task (covered in [[https://ubuntusecuritypodcast.org/episode-12/][Episode 12]])
- NULL pointer dereference in CIFS client in kernel triggered by a malicious server (crash -> DoS)

*** [[[https://usn.ubuntu.com/3881-1/][USN-3881-1]], [[https://usn.ubuntu.com/3881-2/][USN-3881-2]]] Dovecot vulnerability
- 1 CVEs addressed in Precise ESM, Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3814][CVE-2019-3814]]
- Interaction of username / password authentication with trusted SSL cert - can configure for user/pass but can also configure for client to present a trusted cert
- Can configure to take username from cert instead of from explicit username AND also to configure no password if using cert
- BUT if no username in cert, will use specified username - so could log in as any user

*** [[[https://usn.ubuntu.com/3882-1/][USN-3882-1]]] curl vulnerabilities
- 3 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3823][CVE-2019-3823]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3822][CVE-2019-3822]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16890][CVE-2018-16890]]
- OOB read when parsing end of response for SMTP
- Stack buffer overflow when creating an NTLMv2 type-3 header based on previous received data (size checks were not sufficient since they suffered from an integer overflow)
- OOB read for NTLM type-2 handling via an integer overflow

*** [[[https://usn.ubuntu.com/3883-1/][USN-3883-1]]] LibreOffice vulnerabilities
- 5 CVEs addressed in Trusty, Xenial
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16858][CVE-2018-16858]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10583][CVE-2018-10583]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-11790][CVE-2018-11790]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10120][CVE-2018-10120]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10119][CVE-2018-10119]]
- 3 CVEs for mishandling various elements in different document types - UAF, heap-based buffer overflow (write) etc) - crash -> DoS, possible code execution
- Information disclosure (leak of NTLM hashes) via an embedded link to a remote SMB resource within a document
- Directory traversal flaw leading to code execution
  - document can links which like HTML, can have attributes such as a
    script which will get executed without prompting - so onMouseOver()
    etc
  - and this can refer to a file on the local filesystem outside the
    document structure itself
  - libreoffice ships with it's own Python interpreter that contains
    functions which can be abused to run arbitrary commands
  - so can specify both the path to one of these files AND arguments to
    pass to it to run

*** [[[https://usn.ubuntu.com/3884-1/][USN-3884-1]]] libarchive vulnerabilities
- 2 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-1000020][CVE-2019-1000020]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-1000019][CVE-2019-1000019]]
- Infinite loop when parsing a specially crafted ISO9660 CD/DVD iso file -> DoS
- OOB read when decompressing a specially crafted 7z file -> crash -> DoS

*** [[[https://usn.ubuntu.com/3885-1/][USN-3885-1]]] OpenSSH vulnerabilities
- 3 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6111][CVE-2019-6111]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6109][CVE-2019-6109]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-20685][CVE-2018-20685]]
- Three vulnerabilities in scp able to be triggered via a malicious server (low probability)
  - Fails to validate file names from the remote server match the requested ones - server can overwrite arbitrary files on local side in the target directory
  - Fails to use proper character encoding in progress display, allows server to manipulate output of client to hide output of additional files being sent
  - Fails to check if target filename is . or empty - allows remote server to change permissions of the client local directory
- Together allow a server to easily overwrite local files on the client side without the client user being aware

** Goings on in Ubuntu Security Community
*** FAQs about Ubuntu Security
**** What packages are supported?
- main only (~2.3k source packages in Bionic - cf. universe ~26k source packages)
**** What timeframe?
- lifetime of the release - so from official release date to EOL date
- LTS: 5 years, non-LTS: 9 months
- [[https://www.ubuntu.com/esm][ESM provides security fixes beyond the EOL for LTS releases]]
**** Why do we backport patches instead of just updating to the lastest versions?
- Users expect high degree of stability
  - changes need caution and good rationale
  - lots of previous regressions from innocent looking changes
  - no change is completely free of risk
- Only changes which have high impact (security fixes, severe regressions, loss of data etc)
- More details see [[https://wiki.ubuntu.com/StableReleaseUpdates#Why][SRU page on Ubuntu wiki]]
- So security updates must follow suit

** Get in contact
- [[mailto:security@ubuntu.com][security@ubuntu.com]]
- [[http://webchat.freenode.net?channels=%2523ubuntu-hardened&uio=d4][#ubuntu-hardended on the Freenode IRC network]]
- [[https://twitter.com/ubuntu_sec][@ubuntu_sec on twitter]]
